



$APIs="";
$RawAPIs="\r
	原始的Bilibili提供的API\r
	测试完毕请删除";

Begin["`APIs`"];


$RawAPIs=<|
	"archive"-><|
		"url"->StringTemplate["https://api.bilibili.com/x/web-interface/archive/stat?aid=`aid`"],
		"detail"->""
	|>,
	"arch"-><|
		"url"->StringTemplate["https://api.bilibili.com/archive_stat/stat?aid=`aid`"],
		"detail"->"效果和archive接口相同."
	|>,
	"cid"-><|
		"url"->StringTemplate["http://www.bilibilijj.com/Api/AvToCid/`aid`/0"],
		"detail"->"哔哩哔哩唧唧的cid查询端口, 本机必须使用apikeys或cookies才能得到."
	|>,

|>;


$RidList=<|12->"未知(隐藏)-未知",
	15->"连载剧集(隐藏)-电视剧",
	16->"flash游戏(隐藏)-游戏",
	17->"单机联机-游戏",
	19->"Mugen-游戏",
	20->"宅舞-舞蹈",
	21->"日常-生活",
	22->"鬼畜调教-鬼畜",
	24->"MAD/AMV-动画",
	25->"MMD/3D-动画",
	26->"音MAD-鬼畜",
	27->"综合-动画",
	28->"原创音乐-音乐",
	29->"三次元音乐-音乐",
	30->"VOCALOID/UTAU-音乐",
	31->"翻唱-音乐",
	32->"完结动画-番剧",
	33->"连载动画-番剧",
	37->"人文历史-纪录片",
	39->"演讲/公开课-科技",
	41->"未知(隐藏)-未知",
	46->"MMD.3D(隐藏)-动画",
	47->"短片/手书/配音-动画",
	50->"短片/手书/配音(隐藏)-动画",
	51->"资讯-番剧",
	53->"综合(隐藏)-动画",
	54->"OP/ED/OST-音乐",
	56->"VOCALOID(隐藏)-音乐",
	59->"演奏-音乐",
	60->"电子竞技(隐藏)-游戏",
	65->"网络游戏-游戏",
	67->"单机游戏(隐藏)-游戏",
	71->"综艺-娱乐",
	74->"日常(隐藏)-生活",
	75->"动物圈-生活",
	76->"美食圈-生活",
	77->"动物圈(隐藏)-生活",
	79->"动物圈(隐藏)-生活",
	80->"美食圈(隐藏)-生活",
	82->"电影相关(隐藏)-电影",
	83->"其他国家-电影",
	85->"短片-影视",
	86->"特摄-影视",
	94->"完结动画(隐藏)-动画",
	95->"数码-科技",
	96->"星海-科技",
	98->"机械-科技",
	114->"综艺(隐藏)-娱乐",
	116->"未知(隐藏)-未知",
	118->"未知(隐藏)-未知",
	120->"连载动画(隐藏)-动画",
	121->"GMV-游戏",
	122->"野生技术协会-科技",
	124->"趣味科普人文-科技",
	125->"人文历史(隐藏)-纪录片",
	126->"人力VOCALOID-鬼畜",
	127->"教程演示-鬼畜",
	128->"电视剧相关(隐藏)-电视剧",
	130->"音乐选集-音乐",
	131->"Korea相关-娱乐",
	134->"Korea相关(隐藏)-娱乐",
	135->"未知(隐藏)-未知",
	136->"音游-游戏",
	137->"明星-娱乐",
	138->"搞笑-生活",
	139->"网络游戏(隐藏)-游戏",
	141->"游戏集锦(隐藏)-游戏",
	145->"欧美电影-电影",
	146->"日本电影-电影",
	147->"华语电影-电影",
	152->"官方延伸-番剧",
	153->"国产动画-国创",
	154->"三次元舞蹈-舞蹈",
	156->"舞蹈教程-舞蹈",
	157->"美妆-时尚",
	158->"服饰-时尚",
	159->"资讯-时尚",
	161->"手工-生活",
	162->"绘画-生活",
	163->"运动-生活",
	164->"健身-时尚",
	166->"广告-广告",
	168->"国产原创相关-国创",
	169->"布袋戏-国创",
	170->"资讯-国创",
	171->"电子竞技-游戏",
	172->"手机游戏-游戏",
	173->"桌游棋牌-游戏",
	174->"其他-生活",
	175->"ASMR-生活",
	176->"汽车-科技",
	178->"科学探索-纪录片",
	179->"热血军事-纪录片",
	180->"舌尖上的旅行-纪录片",
	182->"影视杂谈-影视",
	183->"影视剪辑-影视",
	184->"预告 资讯-影视",
	185->"国产剧-电视剧",
	187->"海外剧-电视剧"
|>;


$APIs=<|


|>;
End[];